# -*- coding: utf-8 -*-

DUMP = [('АБАКАН', 3, 11),  ('АНАДЫРЬ', 5, 9),  ('АРХАНГЕЛЬСК', 2, 7),  ('АСТРАХАНЬ', 2, 7),  ('БАРНАУЛ', 3, 10), ('БЕЛГОРОД', 2, 5),  ('БИРОБИДЖАН', 5, 13),  ('БЛАГОВЕЩЕНСК', 4, 14),  ('БРЯНСК', 1, 5),  ('ВЕЛИКИЙ НОВГОРОД', 2),  ('ВЛАДИВОСТОК', 5, 14),  ('ВЛАДИКАВКАЗ', 2, 8),  ('ВЛАДИМИР', 1, 5),  ('ВОЛГОГРАД', 2, 7),  ('ВОЛОГДА', 1, 5),  ('ВОРОНЕЖ', 1, 5),  ('ГОРНО-АЛТАЙСК', 3, 12),  ('ГРОЗНЫЙ', 2, 9),  ('ЕКАТЕРИНБУРГ', 2, 7),  ('ИВАНОВО', 1, 5),  ('ИЖЕВСК', 2, 6),  ('ИРКУТСК', 4, 10),  ('ЙОШКАР-ОЛА', 2, 8),  ('КАЗАНЬ', 2, 6),  ('КАЛИНИНГРАД', 2, 6),  ('КАЛУГА', 1, 5),  ('КЕМЕРОВО', 3, 11),  ('КИРОВ', 2, 6),  ('КОСТРОМА', 1, 6),  ('КРАСНОДАР', 2, 8),  ('КРАСНОЯРСК', 3, 9),  ('КУРГАН', 3, 8),  ('КУРСК', 1, 5),  ('КЫЗЫЛ', 3, 13),  ('ЛИПЕЦК', 1, 6),  ('МАГАДАН', 5, 7),  ('МАЙКОП', 2, 8),  ('МАХАЧКАЛА', 3, 9),  ('МОСКВА', 1, 0),  ('МУРМАНСК', 2, 6),  ('НАЗРАНЬ', 2, 10),  ('НАЛЬЧИК', 2, 8),  ('НАРЬЯН-МАР', 2, 8),  ('НИЖНИЙ НОВГОРОД', 1),  ('НОВОСИБИРСК', 3, 9),  ('ОМСК', 3, 8),  ('ОРЕНБУРГ', 2, 6),  ('ОРЁЛ', 1, 5),  ('ПЕНЗА', 2, 5),  ('ПЕРМЬ', 2, 6),  ('ПЕТРОЗАВОДСК', 2, 5),  ('ПЕТРОПАВЛОВСК-КАМЧАТСКИЙ', 5, 36),  ('ПСКОВ', 2, 7),  ('РОСТОВ-НА-ДОНУ', 2, 6),  ('РЯЗАНЬ', 1, 5),  ('САЛЕХАРД', 3, 9),  ('САМАРА', 2, 6),  ('САНКТ-ПЕТЕРБУРГ', 2, 5),  ('САРАНСК', 2, 6),  ('САРАТОВ', 2, 6),  ('СИМФЕРОПОЛЬ', 2, 7),  ('СМОЛЕНСК', 1, 6),  ('СТАВРОПОЛЬ', 2, 7),  ('СЫКТЫВКАР', 2, 7),  ('ТАМБОВ', 1, 5),  ('ТВЕРЬ', 1, 5),  ('ТОМСК', 3, 10),  ('ТУЛА', 1, 5),  ('ТЮМЕНЬ', 3, 8),  ('УЛАН-УДЭ', 4, 11),  ('УЛЬЯНОВСК', 2, 7),  ('УФА', 2, 7),  ('ХАБАРОВСК', 5, 13),  ('ХАНТЫ-МАНСИЙСК', 3, 10),  ('ЧЕБОКСАРЫ', 2, 6),  ('ЧЕЛЯБИНСК', 2, 7),  ('ЧЕРКЕССК', 2, 9),  ('ЧИТА', 4, 11),  ('ЭЛИСТА', 2, 9),  ('ЮЖНО-САХАЛИНСК', 5, 19),  ('ЯКУТСК', 4, 22),  ('ЯРОСЛАВЛЬ', 1, 5),]
REGIONS = [('АБАКАН', 'АБАКАН'),  ('АНАДЫРЬ', 'АНАДЫРЬ'),  ('АРХАНГЕЛЬСК', 'АРХАНГЕЛЬСК'),  ('АСТРАХАНЬ', 'АСТРАХАНЬ'), ('БАРНАУЛ', 'БАРНАУЛ'),  ('БЕЛГОРОД', 'БЕЛГОРОД'),  ('БИРОБИДЖАН', 'БИРОБИДЖАН'),  ('БЛАГОВЕЩЕНСК', 'БЛАГОВЕЩЕНСК'),  ('БРЯНСК', 'БРЯНСК'),  ('ВЕЛИКИЙ НОВГОРОД', 'ВЕЛИКИЙ НОВГОРОД'),  ('ВЛАДИВОСТОК', 'ВЛАДИВОСТОК'),  ('ВЛАДИКАВКАЗ', 'ВЛАДИКАВКАЗ'),  ('ВЛАДИМИР', 'ВЛАДИМИР'),  ('ВОЛГОГРАД', 'ВОЛГОГРАД'),  ('ВОЛОГДА', 'ВОЛОГДА'),  ('ВОРОНЕЖ', 'ВОРОНЕЖ'),  ('ГОРНО-АЛТАЙСК', 'ГОРНО-АЛТАЙСК'),  ('ГРОЗНЫЙ', 'ГРОЗНЫЙ'),  ('ЕКАТЕРИНБУРГ', 'ЕКАТЕРИНБУРГ'),  ('ИВАНОВО', 'ИВАНОВО'),  ('ИЖЕВСК', 'ИЖЕВСК'),  ('ИРКУТСК', 'ИРКУТСК'), ('ЙОШКАР-ОЛА', 'ЙОШКАР-ОЛА'), ('КАЗАНЬ', 'КАЗАНЬ'), ('КАЛИНИНГРАД', 'КАЛИНИНГРАД'),  ('КАЛУГА', 'КАЛУГА'),  ('КЕМЕРОВО', 'КЕМЕРОВО'),  ('КИРОВ', 'КИРОВ'),  ('КОСТРОМА', 'КОСТРОМА'),  ('КРАСНОДАР', 'КРАСНОДАР'),  ('КРАСНОЯРСК', 'КРАСНОЯРСК'),  ('КУРГАН', 'КУРГАН'),  ('КУРСК', 'КУРСК'),  ('КЫЗЫЛ', 'КЫЗЫЛ'),  ('ЛИПЕЦК', 'ЛИПЕЦК'),  ('МАГАДАН', 'МАГАДАН'),  ('МАЙКОП', 'МАЙКОП'),  ('МАХАЧКАЛА', 'МАХАЧКАЛА'),  ('МОСКВА', 'МОСКВА'),  ('МУРМАНСК', 'МУРМАНСК'),  ('НАЗРАНЬ', 'НАЗРАНЬ'),  ('НАЛЬЧИК', 'НАЛЬЧИК'),  ('НАРЬЯН-МАР', 'НАРЬЯН-МАР'),  ('НИЖНИЙ НОВГОРОД', 'НИЖНИЙ НОВГОРОД'),  ('НОВОСИБИРСК', 'НОВОСИБИРСК'),  ('ОМСК', 'ОМСК'),  ('ОРЕНБУРГ', 'ОРЕНБУРГ'),  ('ОРЁЛ', 'ОРЁЛ'),  ('ПЕНЗА', 'ПЕНЗА'),  ('ПЕРМЬ', 'ПЕРМЬ'),  ('ПЕТРОЗАВОДСК', 'ПЕТРОЗАВОДСК'),  ('ПЕТРОПАВЛОВСК-КАМЧАТСКИЙ', 'ПЕТРОПАВЛОВСК-КАМЧАТСКИЙ'),  ('ПСКОВ', 'ПСКОВ'),  ('РОСТОВ-НА-ДОНУ', 'РОСТОВ-НА-ДОНУ'),  ('РЯЗАНЬ', 'РЯЗАНЬ'),  ('САЛЕХАРД', 'САЛЕХАРД'),  ('САМАРА', 'САМАРА'),  ('САНКТ-ПЕТЕРБУРГ', 'САНКТ-ПЕТЕРБУРГ'),  ('САРАНСК', 'САРАНСК'),  ('САРАТОВ', 'САРАТОВ'),  ('СИМФЕРОПОЛЬ', 'СИМФЕРОПОЛЬ'),  ('СМОЛЕНСК', 'СМОЛЕНСК'),  ('СТАВРОПОЛЬ', 'СТАВРОПОЛЬ'),  ('СЫКТЫВКАР', 'СЫКТЫВКАР'),  ('ТАМБОВ', 'ТАМБОВ'),  ('ТВЕРЬ', 'ТВЕРЬ'),  ('ТОМСК', 'ТОМСК'),  ('ТУЛА', 'ТУЛА'),  ('ТЮМЕНЬ', 'ТЮМЕНЬ'),  ('УЛАН-УДЭ', 'УЛАН-УДЭ'),  ('УЛЬЯНОВСК', 'УЛЬЯНОВСК'),  ('УФА', 'УФА'),  ('ХАБАРОВСК', 'ХАБАРОВСК'),  ('ХАНТЫ-МАНСИЙСК', 'ХАНТЫ-МАНСИЙСК'),  ('ЧЕБОКСАРЫ', 'ЧЕБОКСАРЫ'),  ('ЧЕЛЯБИНСК', 'ЧЕЛЯБИНСК'),  ('ЧЕРКЕССК', 'ЧЕРКЕССК'),  ('ЧИТА', 'ЧИТА'),  ('ЭЛИСТА', 'ЭЛИСТА'),  ('ЮЖНО-САХАЛИНСК', 'ЮЖНО-САХАЛИНСК'),  ('ЯКУТСК', 'ЯКУТСК'),  ('ЯРОСЛАВЛЬ', 'ЯРОСЛАВЛЬ'),]
ZONE = [{'zone': 1, 'price': 149.90, 'plus': 13.40}, {'zone': 2, 'price': 152.00, 'plus': 15.60}, {'zone': 3, 'price': 158.10, 'plus': 22.30}, {'zone': 4, 'price': 192.60, 'plus': 31.80}, {'zone': 5, 'price': 215.00, 'plus': 36.40}]


class HelperDelivery():
    weight = 0.00
    price = 0.00

    city = u''
    time = 0
    zone = 0

    start_price = 0.00
    plus = 0.00

    def set_param(self):
        try:
            s_dump = [x for x in DUMP if unicode(x[0], 'utf-8') == self.city]
            self.zone = s_dump[0][1]
            self.time = s_dump[0][2]
        except:
            pass

    def set_price(self):
        try:
            self.start_price = ZONE[self.zone-1]['price']
            self.plus = ZONE[self.zone-1]['plus']
            if self.weight <= 20000:
                self.price = self.weight // 500 * self.plus + self.start_price
        except:
            pass


def calculate_delivery_price(city, weight):
    """функция считает доставку почтой россии
    принимает 2 параметра:
    sity - город (str, обязательно БОЛЬШИМИ буквами)
    weight - вес посылки в граммах (int или float не больше 20000)
    возвращает float стоимость"""
    delivery = HelperDelivery()
    delivery.weight = round(weight, 2)
    delivery.city = city
    delivery.set_param()
    delivery.set_price()
    return delivery.price



# print 'Доставка в город %s будет стоить %s \n время доставки: %s дней с момента отправки' % (delivery.sity, delivery.price, delivery.time)

